### Import

In [2]:
import pandas as pd
print(pd.__version__)

1.3.4

### Persiapan data frame

In [3]:
d = {'pelanggan':[11,12,13,14],
    'kepuasan':['batik','cukup','buruk','cukup']}
df = pd.DataFrame(d)
df

   pelanggan kepuasan
0         11    batik
1         12    cukup
2         13    buruk
3         14    cukup

### Tipe data ordinal pada pandas

In [6]:
from pandas.api.types import CategoricalDtype
tingkat_kepuasan = CategoricalDtype(['buruk','cukup','baik','sangat baik'],
                                   ordered=True)
df['kepuasan'] = df['kepuasan'].astype(tingkat_kepuasan)
df

   pelanggan kepuasan
0         11      NaN
1         12    cukup
2         13    buruk
3         14    cukup

In [7]:
df = df.sort_values('kepuasan',ascending=True)
df

   pelanggan kepuasan
2         13    buruk
1         12    cukup
3         14    cukup
0         11      NaN

In [11]:
df[df['kepuasan'] > 'cukup']

Empty DataFrame
Columns: [pelanggan, kepuasan]
Index: []

In [10]:
df[df['kepuasan'] >= 'cukup']

   pelanggan kepuasan
1         12    cukup
3         14    cukup